# a = int(input("Введите число: "))
# b = int(input("Введите число: "))
# s = int(input("Введите число: "))
# print((a + b + s) / 3)

# celsius = int(input('Введите число: '))
# print((celsius * 9 / 5) + 32)

# a = int(input("Введите число: "))
# print(a ** 2)

a = int(input("Введите число: "))
b = int(input("Введите число: "))
print(f"Сумма: {a + b}\n"
      f"произведение {a * b}\n"
      f"частное с остатком от деления {a / b}\n"
      f"частное без остатка от деления {a // b}\n"
      f"остаток от деления {a % b}")

